<?php

return [
    "notifications" => [
        "mail" => [
            "subject" => "تم إضافة مهمة جديدة - تطبيق إدارة المهام",
            "remember" => [
                "title" => "لديك تنبيه جديد - تطبيق إدارة المهام",
                "body" => "تم إرسال تنبيه جديد لك من المدير ، برجاء الدخول للتطبيق للاطلاع علىه...",
                "text" => "نص التنبيه كما يلى"
            ],
            "message" => 'تم إضافة مهمة جديدة بعنوان :title',
            "message2" => 'برجاء الدخول للتطبيق لمعرفة التفاصيل'
        ]
        ],
        "validations" => [
            "error" => "يجب التأكد من إدخال جميع البيانا المطلوبة بشكل صحيح"
        ]
];